###
# Fugazi brewfile
# ###

# Default taps
tap "filosottile/musl-cross"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jeffreywildman/virt-manager"
tap "neovim/neovim"

# Formulae installed
brew "gdbm"
brew "gettext"
brew "pkg-config"
brew "pcre"
brew "sqlite"
brew "cairo"
brew "harfbuzz"
brew "autoconf"
brew "automake"
brew "awslogs"
brew "bash"
brew "gmp"
brew "comby"
brew "doxygen"
brew "fd"
brew "fzf"
brew "git"
brew "glances"
brew "gnu-sed"
brew "golang-migrate"
brew "handbrake"
brew "ipcalc"
brew "iproute2mac"
brew "jemalloc"
brew "jq"
brew "unibilium"
brew "libtermkey"
brew "libvirt"
brew "libvterm"
brew "libxml2"
brew "luajit"
brew "mosh"
brew "msgpack"
brew "mtr"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "openconnect"
brew "perl"
brew "pipenv"
brew "postgresql@14"
brew "qemu"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "tcptraceroute"
brew "tmux"
brew "todo-txt"
brew "tree"
brew "vala"
brew "vim"
brew "vte3"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "filosottile/musl-cross/musl-cross"

# Casks for Mac applications
cask "abyssoft-teleport"
cask "aerial"
cask "docker"
cask "font-jetbrains-mono-nerd-font"
cask "raycast"
cask "syncthing"
cask "wireshark"
