# Tap some casks
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Formula
brew "bash"
brew "fd"
brew "fzf"
brew "gcc"
brew "git"
brew "glances"
brew "gnutls"
brew "ipcalc"
brew "iproute2mac"
brew "jq"
brew "mas"
brew "mosh"
brew "mtr"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "node"
brew "openconnect"
brew "ripgrep"
brew "rust-analyzer"
brew "shellcheck"
brew "speedtest-cli"
brew "starship"
brew "tcptraceroute"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "wireshark"

# Cask installs
cask "aerial"
cask "font-jetbrains-mono-nerd-font"
